Tekla.Structures.Catalogs.ComponentItem.Select(System.String,System.Int32)
Selects the component item from the component database.
name: The name of the component item to select.
number: The number of the component item to select.
Returns: True on success.